{
  "알고리즘 트레이딩": "컴퓨터를 이용해 어떤 일정한 알고리즘에 따라 자동으로 거래하는 매매 방식"
  "씨오엠(COM)": "여러 컴포넌트 객체를 이용해 프로그램을 개발하는 모델"
  "컴포넌트": "여러 개의 프로그램 함수들을 모아 하나의 특정한 기능을 수행할 수 있도록 구성한 작은 기능적 단위"
  "프레임워크": "어떠한 목적을 달성하기 위해 복잡하게 얽혀있는 문제를 해결하기 위한 구조"
  "토큰화": "텍스트를 토큰의 단위로 분할하는 작업"
  "토큰": "의미를 가지는 최소 의미 단위"
  "정규화": "어떤 대상을 일정한 규칙이나 기준에 따르는 '정규적인' 상태로 바꾸거나, 비정상적인 대상을 정상적으로 되돌리는 과정"
  "데이터 시각화": "데이터를 그림이나 그래픽 형식으로 표현하는 것"
  "알고리즘": "기능을 수행하기 위한 독립된 명령어들의 집합"
  "아작스": "비동기적인 웹 애플리케이션의 제작을 위한 웹 개발 기법이다."
  "추상화": "복잡한 소프트웨어 시스템을 효율적으로 설계하고 구현할 수 있는 방법"
  "문자 집합": "문자, 숫자, 문장 부호, 공백 등의 문자들을 재생하는 방법을 컴퓨터에 알려주는 인코딩 시스템"
  "컴파일": "주어진 언어로 작성된 컴퓨터 프로그램을 다른 언어의 동등한 프로그램으로 변환하는 프로세스"
  "컴퓨터 프로그래밍": "명령어 모음집을 작성하고 구성하는 과정"
  "플렉스박스": "요소를 단일 차원(행 또는 열)에 배치하는 레이아웃 모델."
  "포크": "프로젝트에 누군가의 자신의 수정 사항을 추가하기 위한 어떤 시점에 있는 기존 소프트웨어 프로젝트의 사본"
  "컴파일러": "프로그래밍 언어로 작성한 코드들을 컴퓨터가 이해하는 기계어로 변환해 주는 것"
  "아이디이(IDE)": "효율적으로 소프트웨어를 개발하기 위한 통합 개발환경 소프트웨어 어플리케이션 인터페이스."
  "스크립트 언어": "따로 컴파일 작업이 필요 없는 언어를 말함"
  "렌더링": "논리적인 문서의 표현식을 그래픽 표현식으로 변형시키는 과정"
  "멀티스레드": "동시에 여러 작업이 진행되는 것"
  "명령형 프로그래밍": "프로그램이 어떻게 목적을 달성하는지 그 절차와 방법을 중시하는 프로그래밍 패러다임"
  "선언형 프로그래밍": "프로그램이 무엇을 달성하는지 그 결과에 보다 집중하는 프로그래밍 패러다임."
  "샌드박스": "외부로부터 받은 파일을 바로 실행하지 않고 보호된 영역에서 실행시켜 봄으로써 외부로부터 들어오는 파일과 프로그램이 내부 시스템에 악영향을 주는 것을 미연에 방지하는 기술"
  "정보 사일로": "하나의 정보 시스템이나 하위 시스템이 다른 관련 시스템과 상호 간의 운영을 할 수 없는 배타적인 관리 체제"
  "서브넷": "하나의 네트워크가 분할되어 나눠진 작은 네트워크"
  "고가용성": "서버와 네트워크, 프로그램 등의 정보 시스템이 오랜 기간동안 지속적으로 정상 운영이 가능한 성질"
  "내결함성": "운영중이던 시스템의 데이터가 손실되거나 진행중인 작업이 손상되지 않도록 전원 부족 또는 하드웨어 장애와 같은 돌발 사태에 대비할수 있는 컴퓨터 또는 운영체제의 기능"
  "역제어": "어떤 일을 하도록 만들어진 프레임워크의 제어 권한을 넘김으로써 클라이언트 코드가 신경 써야 할 것을 줄이는 전략"
  "라이브러리": "로그램을 개발하는 데 필요한 여러 기능을 활용할 수 있도록 묶어놓은 함수 또는 기능의 집합"
  "플러그인: 떤 특정한 기능을 해결하는 데 쓸 수 있도록 미리 만들어 놓은 코드 및 데이터의 모음"
  "검색 엔진 최적화(SEO)": "웹 페이지를 구글 등 검색 엔진이나 포털사이트의 기준에 맞춰 구성하는 작업"
  "버그": "프트웨어에서 발생하는 예견치 못한 오류나 오작동"
  "에러": "유저가 입력한 내용이 잘못됐을 때 발생하는 문제"
  "예외": "에러가 일어날 가능성을 개발자가 미리 예상하고 프로그램이 비정상적으로 종료되지 않도록 하는 것"
  "트래픽": "서버를 통해 전송되는 데이터의 양"
  "데이터베이스(DB)": "데이터의 집합."
  "데이터베이스 관리 시스템": "데이터베이스를 통해 데이터를 저장, 수정, 추출할 수 있도록 관리하는 프로그램."
  "오픈소스": "누구나 제한 없이 쓸 수 있는 소스 코드 혹은 소프트웨어. 오픈 소스로 배포된 코드는 열람, 수정, 복제, 재배포 등이 자유롭다"
  "유닉스": "기계어에 가까운 언어인 어셈블리어로 개발한 컴퓨터 운영 체제"
  "정수 인코딩": "단어에 정수를 부여하는 방법"
}
